In [1]:
## Pandas
#- Dataframe - Special Object to data in tabular form (rows and columns)

In [3]:
import numpy as np

import pandas as pd

In [23]:
user_data = {
        'MarksA': [],
        'MarksB': [],
        'MarksC': []
}
for key in user_data:
    user_data[key] = list(np.random.randint(1, 100, 5))

In [25]:
user_data

{'MarksA': [17, 39, 50, 38, 32],
 'MarksB': [38, 13, 83, 16, 64],
 'MarksC': [15, 3, 62, 43, 27]}

In [29]:
df = pd.DataFrame(user_data)

In [31]:
df

   MarksA  MarksB  MarksC
0      17      38      15
1      39      13       3
2      50      83      62
3      38      16      43
4      32      64      27

In [33]:
df.head()

   MarksA  MarksB  MarksC
0      17      38      15
1      39      13       3
2      50      83      62
3      38      16      43
4      32      64      27

In [35]:
df.head(n=3)

   MarksA  MarksB  MarksC
0      17      38      15
1      39      13       3
2      50      83      62

In [41]:
print(list(df.columns))

['MarksA', 'MarksB', 'MarksC']

In [43]:
df.to_csv('marks.csv')

In [47]:
 my_data = pd.read_csv('marks.csv')

In [49]:
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      17      38      15
1           1      39      13       3
2           2      50      83      62
3           3      38      16      43
4           4      32      64      27

In [51]:
my_data.drop(columns = ['Unnamed: 0'])

   MarksA  MarksB  MarksC
0      17      38      15
1      39      13       3
2      50      83      62
3      38      16      43
4      32      64      27

In [53]:
my_data.describe()

       Unnamed: 0     MarksA     MarksB     MarksC
count    5.000000   5.000000   5.000000   5.000000
mean     2.000000  35.200000  42.800000  30.000000
std      1.581139  12.070626  30.392433  23.216374
min      0.000000  17.000000  13.000000   3.000000
25%      1.000000  32.000000  16.000000  15.000000
50%      2.000000  38.000000  38.000000  27.000000
75%      3.000000  39.000000  64.000000  43.000000
max      4.000000  50.000000  83.000000  62.000000

In [57]:
my_data.tail(n = 3)

   Unnamed: 0  MarksA  MarksB  MarksC
2           2      50      83      62
3           3      38      16      43
4           4      32      64      27

In [65]:
np.mean(df.iloc[2:4, 0:1])

44.0

In [67]:
idx = df.columns.get_loc('MarksB')
df.iloc[3, idx]

16

In [71]:
idx  = [df.columns.get_loc('MarksB'), df.columns.get_loc('MarksA')]
df.iloc[3, idx]

MarksB    16
MarksA    38
Name: 3, dtype: int64

In [79]:
df.sort_values(by = ['MarksA','MarksB'], ascending =True)

   MarksA  MarksB  MarksC
0      17      38      15
4      32      64      27
3      38      16      43
1      39      13       3
2      50      83      62

In [93]:
data_array = df.values

In [95]:
data_array

array([[17, 38, 15],
       [39, 13,  3],
       [50, 83, 62],
       [38, 16, 43],
       [32, 64, 27]])

In [97]:
print(data_array.shape)

(5, 3)

In [99]:
print(df.shape)

(5, 3)

In [103]:
new_df = pd.DataFrame(data_array, dtype = 'int32', columns = ['Physics', 'Chemistry', 'Maths' ])

In [109]:
# While saving the file we must avoid storing the first row
new_df.to_csv('PCM.csv', index = False)